In [10]:
from splinter import Browser
from bs4 import BeautifulSoup as soup
from webdriver_manager.chrome import ChromeDriverManager
import pandas as pd

In [2]:
# Set up Splinter
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

====== WebDriver manager ======
Current google-chrome version is 91.0.4472
Get LATEST driver version for 91.0.4472
Get LATEST driver version for 91.0.4472
Trying to download new driver from https://chromedriver.storage.googleapis.com/91.0.4472.101/chromedriver_win32.zip
Driver has been saved in cache [C:\Users\tgrah\.wdm\drivers\chromedriver\win32\91.0.4472.101]

In [4]:
# go to website to scrape
url = "https://www.olympedia.org/editions"
browser.visit(url)

# parse HTML
html = browser.html
html_soup = soup(html, 'html.parser')

In [11]:
# read html with pandas (bs4 and parser working on backend)
test_df = pd.read_html(url) # returs list of all tables on the page

In [12]:
print(f'Total tables: {len(test_df)}')

Total tables: 8

In [97]:
# NOTE: code below could also be used to pull Winter from the winter table 
# look for tables with Tokyo
table_tokyo = pd.read_html(url, match="Tokyo", converters={"City":str})
# len(table_tokyo) # returns 1 so that is the table that we want

In [98]:
# read table as DF
sum_olympic_org = table_tokyo[0]
sum_olympic_org.head()

# NOTE: country coming in as NaN because it is a picture of a flag. Scrape country codes from the img tags.

,#,Year,City,Country,Opened,Closed,Competition,Unnamed: 7
0,I,1896,Athina,NaN,6 April,15 April,6 â 13 April,NaN
1,II,1900,Paris,NaN,NaN,NaN,14 May â 28 October,NaN
2,III,1904,St. Louis,NaN,14 May,NaN,1 July â 23 November,NaN
3,IV,1908,London,NaN,13 July,NaN,27 April â 31 October,NaN
4,V,1912,Stockholm,NaN,6 July,27 July,5 May â 27 July,NaN

In [99]:
# trying to get the country codes
# get the image tag from the correct column in the first table
# set table reference
table_to_scrape = html_soup.find_all('table')[0]

# for td in html_soup.find_all('td'):
#     if td.img:
#         print(td.img['src'])

# get table rows
table_body = table_to_scrape.find_all('tr')

In [100]:
# get number of rows in the table
body_rows = table_body[0:]
# len(body_rows)

In [101]:
# loop through rows and get the image source tags


# define empty list to hold the src tags
flag_images = []

# set row number to pass to table_body[]
for row_num in range(len(body_rows)):

    # loop through each row in the table body and find all rows
    for row in table_body[row_num].find_all('td'):
         
        # check to see if the row has an img tag 
        if row.img:
            # append the img src tag to a list
            flag_images.append(row.img['src'])

In [102]:
# use regex to get the country code from the img src
import re
country_codes = []
# loop through list and pull 3 alphanumeric before '.'
for src in flag_images:
    code = re.findall(r"(\w{3})\.", src) # maybe not the most efficient way but all the strings were the same so took a shot at it
    # append to list
    country_codes.append(code)

In [103]:
# regex loop returned a list of lists so extract into single list
country_codes = [x[0] for x in country_codes]

In [104]:
# get rid of columns we don't need
sum_olympic_cln = sum_olympic_org[['Year', 'City', 'Country']].copy()
sum_olympic_cln.head()

   Year       City  Country
0  1896     Athina      NaN
1  1900      Paris      NaN
2  1904  St. Louis      NaN
3  1908     London      NaN
4  1912  Stockholm      NaN

In [105]:
# replace the NaNs in the Country column with country_codes list
sum_olympic_cln['Country'] = country_codes
sum_olympic_cln.head()

   Year       City Country
0  1896     Athina     GRE
1  1900      Paris     FRA
2  1904  St. Louis     USA
3  1908     London     GBR
4  1912  Stockholm     SWE

In [109]:
# check DF
sum_olympic_cln.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Year     34 non-null     int64
 1   City     34 non-null     object
 2   Country  34 non-null     object
dtypes: int64(1), object(2)
memory usage: 944.0+ bytes

In [111]:
# get rid of everything before 1964 and after 2016
analysis_years = sum_olympic_cln.copy()
analysis_years.drop(analysis_years[(analysis_years['Year'] < 1964) | (analysis_years['Year'] > 2016)].index, inplace=True)

    Year               City Country
17  1964              Tokyo     JPN
18  1968  Ciudad de MÃ©xico     MEX
19  1972           MÃ¼nchen     FRG
20  1976          MontrÃ©al     CAN
21  1980             Moskva     URS
22  1984        Los Angeles     USA
23  1988              Seoul     KOR
24  1992          Barcelona     ESP
25  1996            Atlanta     USA
26  2000             Sydney     AUS
27  2004             Athina     GRE
28  2008            Beijing     CHN
29  2012             London     GBR
30  2016     Rio de Janeiro     BRA

# Moving to individual year medals pages
1 - navigate to correct page

2 - locate medal table

3 - load medal table as DF with index as the year

4 - merge with the summer olympic table -

In [117]:
# get years into a list so you can use them for href and click
years_list = analysis_years['Year'].tolist()

# years are int - need them to be string to pass to scraping loop so convert
years_list = [str(x) for x in years_list]

In [157]:
# from xpath we know the table row to start is 18 
# browser.find_by_xpath('/html/body/div[2]/table[1]/tbody/tr[18]/td[2]/a'). click() # this also works but is less understandable

# NOTE: according to this link https://stackoverflow.com/questions/13784192/creating-an-empty-pandas-dataframe-then-filling-it it is not a good idea to append dataframes in a loop. Working on scraping to lists or dictionaries and then turning into dataframe but this loop should work despite it being memory intensive if we need to use it. 

# create the first dataframe - 1964
# complete_medals_table = Data - was going to create a blank dataframe to append to but apparently that's not a good idea

# test list = successful for 2 years
test_years = ['1964', '1968']

# set iterator
counter = 0

# df dictionary - testing
# https://stackoverflow.com/questions/30233982/merge-dataframes-in-a-dictionary

all_years = {}

# start for loop to get all of the year medal tables
for year in years_list: # change back to years_list when testing complete

    browser.find_by_text(year).click() # this works - loop step 1

    # get page url - loop step 2
    page_url = browser.url

    # reset soup
    # parse HTML
    html = browser.html
    html_soup = soup(html, 'html.parser')

    # get all tables on the page as DFs 
    page_dfs = pd.read_html(page_url)
    # print(f'Total tables: {len(page_dfs)}') # check number of tables on page - use for debugging

    # get the medal table and load to DF
    # medals_table = pd.read_html(page_url, match="NOC")[0] # loop step 3
    all_years[year] = pd.read_html(page_url, match="NOC")[0] # loop step 3

    # add column 'year' with the year of the games - loop step 4
    # medals_table['Year'] = int(year)
    all_years[year]['Year'] = int(year)

    # rename the columns - loop step 5
    medals_table.rename(columns={'NOC': 'Country', 'NOC.1': 'Country Code'}, inplace=True)
    all_years[year].rename(columns={'NOC': 'Country', 'NOC.1': 'Country Code'}, inplace=True)

    # NOTE: may get rid of this in favor of adding to dictionary and then appending.
    # if this is the first year then just save as DF, otherwise append to the DF
    # if counter != 0:
        # medals_table = medals_table.append(medals_table, ignore_index=True)

    # counter += 1

    # go back to the main page
    browser.back()

browser.quit()

In [158]:
# check that we pulled all years should = 14 - looks good so far
len(all_years)

14

In [155]:
# doing some testing here - it looks like the dictionary method is going to work
append_years = all_years['1964'].append(all_years['1968'], ignore_index=True)
append_years_1968 = append_years[append_years['Year'] == 1968]
append_years_1968

                     Country Country Code  Gold  Silver  Bronze  Total  Year
41             United States          USA    45      28      34    107  1968
42              Soviet Union          URS    29      32      30     91  1968
43                     Japan          JPN    11       7       7     25  1968
44                   Hungary          HUN    10      10      12     32  1968
45              East Germany          GDR     9       9       7     25  1968
46                    France          FRA     7       3       5     15  1968
47            Czechoslovakia          TCH     7       2       4     13  1968
48              West Germany          FRG     5      11      10     26  1968
49                 Australia          AUS     5       7       5     17  1968
50             Great Britain          GBR     5       5       3     13  1968
51                    Poland          POL     5       2      11     18  1968
52                   Romania          ROU     4       6       5     15  1968
53                     Italy          ITA     3       4       9     16  1968
54                     Kenya          KEN     3       4       2      9  1968
55                    Mexico          MEX     3       3       3      9  1968
56                Yugoslavia          YUG     3       3       2      8  1968
57               Netherlands          NED     3       3       1      7  1968
58                  Bulgaria          BUL     2       4       3      9  1968
59  Islamic Republic of Iran          IRI     2       1       2      5  1968
60                    Sweden          SWE     2       1       1      4  1968
61                    Turkey          TUR     2       0       0      2  1968
62                   Denmark          DEN     1       4       3      8  1968
63                    Canada          CAN     1       3       1      5  1968
64                   Finland          FIN     1       2       1      4  1968
65                  Ethiopia          ETH     1       1       0      2  1968
66                    Norway          NOR     1       1       0      2  1968
67               New Zealand          NZL     1       0       2      3  1968
68                   Tunisia          TUN     1       0       1      2  1968
69                  Pakistan          PAK     1       0       0      1  1968
70                 Venezuela          VEN     1       0       0      1  1968
71                      Cuba          CUB     0       4       0      4  1968
72                   Austria          AUT     0       2       2      4  1968
73               Switzerland          SUI     0       1       4      5  1968
74                  Mongolia          MGL     0       1       3      4  1968
75                    Brazil          BRA     0       1       2      3  1968
76                   Belgium          BEL     0       1       1      2  1968
77         Republic of Korea          KOR     0       1       1      2  1968
78                    Uganda          UGA     0       1       1      2  1968
79                  Cameroon          CMR     0       1       0      1  1968
80                   Jamaica          JAM     0       1       0      1  1968
81                 Argentina          ARG     0       0       2      2  1968
82            Chinese Taipei          TPE     0       0       1      1  1968
83                    Greece          GRE     0       0       1      1  1968
84                     India          IND     0       0       1      1  1968

In [170]:
complete_summer_data = pd.concat(all_years.values(), ignore_index=True)
print(complete_summer_data.shape)
complete_summer_data.Year.unique().tolist()
complete_summer_data.head()

(865, 7)

In [178]:
# send to a csv to double check the data
complete_summer_df.to_csv('complete_year_datascrape_07182021.csv')

# Below is working on potentially parsing each table into a list and then making the dataframe from the list of lists. 

### NOTE: 

It looks like the loop above is going to work and I doubt we are going to get graded on the time the code takes to process but left the link and maybe this challenge in here if we want to do it the 'most effective' way.

Maybe this would be an issue if we had more data but it didn't seem like an issue for the medals by year. 

link with good info on why not to append dataframes but not related to scraping 
- https://stackoverflow.com/questions/13784192/creating-an-empty-pandas-dataframe-then-filling-it 

## Ideas: Maybe pull tables with pd.read_html still and then send each column to a list with tolist(). Append those lists to a master list or dictionary, and then make a combined df with the data?

In [182]:
# started some testing on scraping to lists

# /html/body/div[2]/table[5]/thead/tr/th[1]
url = "https://www.olympedia.org/editions/16"

html = browser.html
html_soup = soup(html, 'html.parser')

# set table reference
year_results_table = html_soup.find_all('table')[5]
table_headers = []
for year_results_table
# get the table headers
# set the headers as dictionary keys
# append column values to the key:values
# go to the next page and repeat
# turn the dictionary into a dataframe